# ExternalResourceSubFolder Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceSubFolder Properties
ExternalResourceSubFolder Class See Also
---
The ExternalResourceSubFolder type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FolderName | Folder displayed name. |
| IconPath | The path of the resource icon. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace